REQUERIMIENTO

    # [CUIT VALIDATOR ] integrandose con servicios AFIP valida CUIT de personas

    **Tipo:** microservicio  
    **Tecnologia:** Python3
    **Protocolo:** FastAPI - JSON REST

    ---

    ## Descripción

    Necesito que me ayudes a construir un servicio en Python utilizando FASTAPI y una arquitecura simple y concisa 
    (controller  con metodo get - service con metodo get - connector con servicio de auth y get)

    ### Requerimiento
    ```
    (controller  con metodo get - service con metodo get - connector con servicio de auth y get)
    Servicio que se conecte con los servicios de AFIP https://aws.afip.gov.ar/sr-padron/webservices para consultas y https://wsaa.afip.gov.ar/ws/services/LoginCms para autenticación.
    El cual consuma el padron Consulta a Padrón Alcance 13 (documentación https://www.afip.gob.ar/ws/ws-padron-a13/manual-ws-sr-padron-a13-v1.3.pdf )
    Con previa autenticación en serivcio WSAA https://www.afip.gob.ar/ws/documentacion/wsaa.asp con su respectivo manual https://www.afip.gob.ar/ws/WSAA/WSAAmanualDev.pdf
    La arquitectura de comunicación esta detallada en https://www.afip.gob.ar/ws/documentacion/arquitectura-general.asp y https://www.afip.gob.ar/ws/documentacion/catalogo.asp

    ```

    ---

    ## Consideraciones Tecnicas
    - Arquitectura Controller - Service - Component (connector AFIP)
    - Diseñar la obtención del token con una cache interna (con que sea un bean con vencimiento alcanza) 
    - Documentar el comportmiento y generación de secrets en el readme del servicio.
    - Documentar comportamiento en README.md
    - Tener parametrizado TEST y PROD teniendo en cuenta URLs de AFIP
    - Todo valor de parametria tiene que ser obtenido desde un archivo .env


    ---
    ## Consideraciones Funcionales
    - basarte en /Users/jpastorino/git/people-arca-connector para comportamiento de servicio de consulta de datos. Solo consideraciones necesarias
    - basarte en /Users/jpastorino/git/token-arca-admin para comportamiento de servicio de obtención de token. Solo consideraciones necesarias

    ---
    ## Consideraciones Documentación

    podrias generarme un archivo tutorial-token.md que me guie en generar el certificado correctamente para el servicio que usamos
    https://www.afip.gob.ar/ws/WSAA/Especificacion_Tecnica_WSAA_1.2.2.pdf
    https://www.afip.gob.ar/ws/WSAA/wsaa_asociar_certificado_a_wsn_produccion.pdf
    https://www.afip.gob.ar/ws/WSAA/wsaa_obtener_certificado_produccion.pdf
    https://www.afip.gob.ar/ws/WSAA/WSAAmanualDev.pdf

    ---
    ## Nuevo endpoint
      Por mi nivel de CLave en AFIP no puedo consultar el servicio desarrollado, podrias analizar https://www.afip.gob.ar/ws/ws-padron-a13/manual-ws-sr-padron-a13-v1.3.pdf y ver si este servicio sirve, en caso de serlo armar plan de adecuación del servicio actual para poder implementar este cambio
  
  
    ---
    ## Nuevo endpoint Consulta por DNI
      En base al archivo PersonaServiceA13.wsdl podriamos determinar que existe una funcionalidad getIdPersonaListByDocumento. Me gustaria que implementemos un metodo a nivel controller que haga lo siguiente:
      "/dni/{dni}"
      El cual reciba un DNI por parametro, invoque al service dni service que utilice PadronConnector invocando al metodo indicado del WSDL. Luego, orqueste por cada CUIT idPersonaListReturn.idPersona de la respuesta para poder asi ir recolectando los datos de las personas devueltas, a excepción de direcciones, para este caso no es necesario.
       Dejo un ejemplo de como se comporta el servicio AFIP
        REQ
       <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:a13="http://a13.soap.ws.server.puc.sr/">
        <soapenv:Header/>
        <soapenv:Body>
        <a13:getIdPersonaListByDocumento>
        <token>${tokensign#token}</token>
        <sign>${tokensign#sign}</sign>
        <cuitRepresentada>${parametros#cuit_representada}</cuitRepresentada>
        <documento>0011709676</documento>
        </a13:getIdPersonaListByDocumento>
        Manual Consulta a Padrón – Alcance 13 – V.1.3 Pág. 13 de 20
        </soapenv:Body>
        </soapenv:Envelope>
        RSP
        <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Body>
        <ns2:getIdPersonaListByDocumentoResponse xmlns:ns2="http://a13.soap.ws.server.puc.sr/">
        <idPersonaListReturn>
        <idPersona>23117096769</idPersona>
        <idPersona>27117096764</idPersona>
        <metadata>
        <fechaHora>2025-07-17T16:22:09.168-03:00</fechaHora>
        <servidor>qa-sr-padron-ws.cloudhomo.afip.gob.ar</servidor>
        </metadata>
        </idPersonaListReturn>
        </ns2:getIdPersonaListByDocumentoResponse>
        </soap:Body>
        </soap:Envelope>

        Y como deberia ser la respuesta de nuestro servicio:
        [
        {
          "cuit": "20351798239",
          "tipo_persona": "FISICA",
          "apellido": "PASTORINO",
          "nombre": "JORGE ANTONIO",
          "estado_clave": "ACTIVO"
        },{
          "cuit": "20351798239",
          "tipo_persona": "FISICA",
          "apellido": "PASTORINO",
          "nombre": "JORGE ANTONIO",
          "estado_clave": "ACTIVO"
        }
        ]

        Mantener criterios de integración, orquestación y logs de los servicios ya implementados.